{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_5", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block1_conv1", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block1_conv1", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block1_conv2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "name": "block1_pool", "strides": [2, 2], "padding": "valid"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block2_conv1", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block2_conv2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "name": "block2_pool", "strides": [2, 2], "padding": "valid"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block3_conv1", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block3_conv2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block3_conv3", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "name": "block3_pool", "strides": [2, 2], "padding": "valid"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block4_conv1", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block4_conv2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block4_conv3", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "block4_pool", "strides": [2, 2], "padding": "valid"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block5_conv1", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block5_conv2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "block5_conv3", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3]}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "block5_pool", "strides": [2, 2], "padding": "valid"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_9"}, "name": "flatten_9", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_12", "rate": 0.35}, "name": "dropout_12", "inbound_nodes": [[["flatten_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 512, "use_bias": true, "bias_regularizer": null, "name": "dense_20", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}, "name": "dense_20", "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "rate": 0.35}, "name": "dropout_13", "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 512, "use_bias": true, "bias_regularizer": null, "name": "dense_21", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}, "name": "dense_21", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 7, "use_bias": true, "bias_regularizer": null, "name": "dense_22", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}, "name": "dense_22", "inbound_nodes": [[["dense_21", 0, 0, {}]]]}], "name": "model_9", "input_layers": [["input_5", 0, 0]], "output_layers": [["dense_22", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}